Ran Plan for 3 projects:

1. project: `crawlinghub-ecs-web-api-prod` dir: `terraform/ecs-web-api` workspace: `default`
1. project: `crawlinghub-ecs-scheduler-prod` dir: `terraform/ecs-scheduler` workspace: `default`
1. project: `crawlinghub-eventbridge-prod` dir: `terraform/eventbridge` workspace: `default`
---

### 1. project: `crawlinghub-ecs-web-api-prod` dir: `terraform/ecs-web-api` workspace: `default`
**Plan Error**
```
running "/home/atlantis/.atlantis/bin/terraform1.8.1 plan -input=false -refresh -out \"/home/atlantis/.atlantis/repos/ryu-qqq/CrawlingHub/41/default/terraform/ecs-web-api/crawlinghub-ecs-web-api-prod-default.tfplan\"" in "/home/atlantis/.atlantis/repos/ryu-qqq/CrawlingHub/41/default/terraform/ecs-web-api": exit status 1
╷
│ Error: Required plugins are not installed
│ 
│ The installed provider plugins are not consistent with the packages
│ selected in the dependency lock file:
│   - registry.terraform.io/hashicorp/aws: the cached package for registry.terraform.io/hashicorp/aws 5.100.0 (in .terraform/providers) does not match any of the checksums recorded in the dependency lock file
│ 
│ Terraform uses external plugins to integrate with a variety of different
│ infrastructure services. You must install the required plugins before
│ running Terraform operations.
╵

```

---
### 2. project: `crawlinghub-ecs-scheduler-prod` dir: `terraform/ecs-scheduler` workspace: `default`
**Plan Error**
```
running "/home/atlantis/.atlantis/bin/terraform1.8.1 plan -input=false -refresh -out \"/home/atlantis/.atlantis/repos/ryu-qqq/CrawlingHub/41/default/terraform/ecs-scheduler/crawlinghub-ecs-scheduler-prod-default.tfplan\"" in "/home/atlantis/.atlantis/repos/ryu-qqq/CrawlingHub/41/default/terraform/ecs-scheduler": exit status 1
╷
│ Error: Required plugins are not installed
│ 
│ The installed provider plugins are not consistent with the packages
│ selected in the dependency lock file:
│   - registry.terraform.io/hashicorp/aws: the cached package for registry.terraform.io/hashicorp/aws 5.100.0 (in .terraform/providers) does not match any of the checksums recorded in the dependency lock file
│ 
│ Terraform uses external plugins to integrate with a variety of different
│ infrastructure services. You must install the required plugins before
│ running Terraform operations.
╵

```

---
### 3. project: `crawlinghub-eventbridge-prod` dir: `terraform/eventbridge` workspace: `default`
**Plan Error**
<details><summary>Show Output</summary>

```
running "/home/atlantis/.atlantis/bin/terraform1.8.1 plan -input=false -refresh -out \"/home/atlantis/.atlantis/repos/ryu-qqq/CrawlingHub/41/default/terraform/eventbridge/crawlinghub-eventbridge-prod-default.tfplan\"" in "/home/atlantis/.atlantis/repos/ryu-qqq/CrawlingHub/41/default/terraform/eventbridge": exit status 1
data.aws_ecs_cluster.this: Reading...
data.aws_ssm_parameter.private_subnets: Reading...
data.aws_ecs_task_definition.scheduler: Reading...
data.aws_ssm_parameter.vpc_id: Reading...
data.aws_ssm_parameter.vpc_id: Read complete after 0s [id=/shared/network/vpc-id]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform planned the following actions, but then encountered a problem:

  # aws_security_group.eventbridge_task will be created
  + resource "aws_security_group" "eventbridge_task" {
      + arn                    = (known after apply)
      + description            = "Security group for EventBridge triggered ECS tasks"
      + egress                 = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
                # (1 unchanged attribute hidden)
            },
        ]
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = "crawlinghub-eventbridge-task-sg-prod"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Name" = "crawlinghub-eventbridge-task-sg-prod"
        }
      + tags_all               = {
          + "Environment" = "prod"
          + "ManagedBy"   = "terraform"
          + "Name"        = "crawlinghub-eventbridge-task-sg-prod"
          + "Project"     = "crawlinghub"
        }
      + vpc_id                 = (sensitive value)
    }

  # module.crawler_scheduler.aws_cloudwatch_event_rule.this will be created
  + resource "aws_cloudwatch_event_rule" "this" {
      + arn                 = (known after apply)
      + description         = "Crawlinghub scheduled crawling tasks"
      + event_bus_name      = "default"
      + force_destroy       = false
      + id                  = (known after apply)
      + name                = "crawlinghub-scheduler-prod"
      + name_prefix         = (known after apply)
      + schedule_expression = "rate(1 hour)"
      + state               = "ENABLED"
      + tags                = {
          + "Environment" = "prod"
          + "Name"        = "crawlinghub-scheduler-prod"
          + "Service"     = "crawlinghub-eventbridge-prod"
        }
      + tags_all            = {
          + "Environment" = "prod"
          + "ManagedBy"   = "terraform"
          + "Name"        = "crawlinghub-scheduler-prod"
          + "Project"     = "crawlinghub"
          + "Service"     = "crawlinghub-eventbridge-prod"
        }
    }

  # module.crawler_scheduler.aws_iam_role.eventbridge[0] will be created
  + resource "aws_iam_role" "eventbridge" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "events.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "crawlinghub-scheduler-prod-eventbridge-role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags                  = {
          + "Environment" = "prod"
          + "Name"        = "crawlinghub-scheduler-prod-eventbridge-role"
          + "Service"     = "crawlinghub-eventbridge-prod"
        }
      + tags_all              = {
          + "Environment" = "prod"
          + "ManagedBy"   = "terraform"
          + "Name"        = "crawlinghub-scheduler-prod-eventbridge-role"
          + "Project"     = "crawlinghub"
          + "Service"     = "crawlinghub-eventbridge-prod"
        }
      + unique_id             = (known after apply)
    }

Plan: 3 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + eventbridge_rule_arn  = (known after apply)
  + eventbridge_rule_name = "crawlinghub-scheduler-prod"
╷
│ Error: reading ECS Cluster (crawlinghub-cluster-prod): empty result
│ 
│   with data.aws_ecs_cluster.this,
│   on main.tf line 43, in data "aws_ecs_cluster" "this":
│   43: data "aws_ecs_cluster" "this" {
│ 
╵
╷
│ Error: reading ECS Task Definition (crawlinghub-scheduler-prod): couldn't find resource
│ 
│   with data.aws_ecs_task_definition.scheduler,
│   on main.tf line 47, in data "aws_ecs_task_definition" "scheduler":
│   47: data "aws_ecs_task_definition" "scheduler" {
│ 
╵
╷
│ Error: reading SSM Parameter (/shared/network/private-subnets): couldn't find resource
│ 
│   with data.aws_ssm_parameter.private_subnets,
│   on provider.tf line 58, in data "aws_ssm_parameter" "private_subnets":
│   58: data "aws_ssm_parameter" "private_subnets" {
│ 
╵

```
</details>

---
### Plan Summary

3 projects, 0 with changes, 0 with no changes, 3 failed

* :fast_forward: To **apply** all unapplied plans from this Pull Request, comment:
  ```shell
  atlantis apply
  ```
* :put_litter_in_its_place: To **delete** all plans and locks from this Pull Request, comment:
  ```shell
  atlantis unlock
  ```